# 예제1

1. mtcars 데이터셋의 sqec 컬럼을 최소최대척도로 변환 후 0.5보다 큰 값을 가지는 레코드 수를 구하라

In [23]:
# 라이브러리 불러오기
import pandas as pd

# 데이터셋 불러오기
data = pd.read_csv(r"C:\Users\User\kt\개인공부 정리\판다스 최종 복습판\데이터셋\part2\1유형\mtcars.csv")

In [25]:
# 데이터 확인
data.head()

,car_name,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [31]:
# qsec 열을 정규화 해주기
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler()
data['qsec'] = scaler.fit_transform(data[['qsec']])

In [43]:
# 0.5보다 큰 것을 뽑아 냄
temp =data.loc[data['qsec']>0.5]

# 갯수 확인
len(temp)

9

# 예제2

1. titanic 데이터셋의 승선한 사람들의 클래스와 성별 10개를 나이가 많은 순서로 나열하여 데이터 프레임 형태로 출력하라

In [108]:
# 라이브러리 불러오기
import pandas as pd

# 데이터 불러오기.
titanic = pd.read_csv(r'part1\titanic.csv')

In [110]:
# 데이터 확인
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,8.0500,S

In [112]:
# 나이가 많은 순으로 정렬하기
sort_data = titanic.sort_values(by='Age',ascending = False)[:10]

#  클래스와 성별을 데이터 프레임으로 뽑아내기
sort_data[['Pclass','Sex']]

     Pclass   Sex
630       1  male
851       3  male
493       1  male
96        1  male
116       3  male
672       2  male
745       1  male
33        2  male
54        1  male
280       3  male

2. Age의 결측치값을 평균으로 채우고, age를 표준정규분포로 스케일링한 값을 age_scale열에 저장하라.

In [115]:
# 결측치 부터 확인
titanic['Age'].isna().sum()

177

In [117]:
# 결측치를 평균으로 채워넣기
titanic['Age'] = titanic['Age'].fillna(titanic['Age'].mean())

In [121]:
# 결측치 확인
titanic['Age'].isna().sum()

0

In [125]:
# 라이브러리 불러와 표준정규분포 만들기
from sklearn.preprocessing import StandardScaler

# 표준화 만들기
scaler = StandardScaler()
titanic['age_scale'] = scaler.fit_transform(titanic[['Age']])

In [127]:
# 정답 출력
print(titanic['age_scale'])

0     -0.592481
1      0.638789
2     -0.284663
3      0.407926
4      0.407926
         ...
886   -0.207709
887   -0.823344
888    0.000000
889   -0.284663
890    0.177063
Name: age_scale, Length: 891, dtype: float64

3. 연령대가 30대인 데이터를 추출하여 그 추출된 데이터 중에서 생존한 사람들의 pclass,sex,age,sibsp데이터를 데이터 프레임 형태로 상위 5개 나타내라

In [144]:
# 연령대가 30대인 데이터에서 특정열 추출하기
more_than30 = titanic.loc[ (titanic['Age']>=30) & (titanic['Age'] <40) & (titanic['Survived']==1) ,['Pclass','Sex','Age','SibSp']]

# 생존한 사람으로 다시 추출하기
more_than30.head()

    Pclass     Sex   Age  SibSp
1        1  female  38.0      1
3        1  female  35.0      1
21       2    male  34.0      0
25       3  female  38.0      1
61       1  female  38.0      0

4. 생존한 사람과 생존하지 않은 사람들의 나이 평균값을 순서대로 소수점 2째자리까지 구하라.  
   단, 나이 결측치는 전체 탑승자의 평균으로 채워라

In [154]:
# 결측치는 이미 앞서 채웠기에 넘기고 , 생존한 사람과 아닌 사람의 나이 평균을 구해보기
titanic.groupby(by='Survived',as_index= False)['Age'].mean().round(2)

   Survived    Age
0         0  30.42
1         1  28.55

5. 요금의 최고와 최저의 평균을 구하라

In [161]:
# 최대외 최소를 구하기
fare_min = titanic['Fare'].min()
fare_max = titanic['Fare'].max()

# 평균값 계산하기
fare_mean = (fare_max + fare_min)/2

# 평균값 출력
fare_mean

256.1646

6. 생존자 중에서 pclass가 2보다 큰 승객의 이름, 나이, 성별을 데이터 프레임 형태로 출력하라

In [167]:
titanic.loc[(titanic['Survived'] == 1) & (titanic['Pclass'] >= 2), ['Name','Age','Sex']]

                                                  Name   Age     Sex
2                               Heikkinen, Miss. Laina  26.0  female
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0  female
9                  Nasser, Mrs. Nicholas (Adele Achem)  14.0  female
10                     Sandstrom, Miss. Marguerite Rut   4.0  female
15                    Hewlett, Mrs. (Mary D Kingcome)   55.0  female
..                                                 ...   ...     ...
866                       Duran y More, Miss. Asuncion  27.0  female
869                    Johnson, Master. Harold Theodor   4.0    male
874              Abelson, Mrs. Samuel (Hannah Wizosky)  28.0  female
875                   Najib, Miss. Adele Kiamie "Jane"  15.0  female
880       Shelley, Mrs. William (Imanita Parrish Hall)  25.0  female

[206 rows x 3 columns]

# 예제3

1.alcalinity of ash의 평균값과 표준편차를 정수형태로 구하라.

In [181]:
# 라이브러리 불러오기
import pandas as pd

# 데이터 불러오기
wine = pd.read_csv(r'part2/1유형/Wine dataset.csv')

# 데이터 확인
wine.head()

,class,Alcohol,Malic acid,Ash,Alcalinity of ash,Magnesium,Total phenols,Flavanoids,Nonflavanoid phenols,Proanthocyanins,Color intensity,Hue,OD280/OD315 of diluted wines,Proline
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [189]:
# Alcalinity of ash 의 평균과 표준편차를 정수로 구하기
alcalinity_mean = int( wine['Alcalinity of ash'].mean() )
alcalinity_std = int( wine['Alcalinity of ash'].std() )

#출력
alcalinity_mean , alcalinity_std

(19, 3)

2. Flavanoids 변수 상위 5개의 color intensity와 alcohol을 데이터 프레임 형태로 나타내라

In [194]:
wine.sort_values(by='Flavanoids', ascending= False)[['Color intensity','Alcohol']].head()

     Color intensity  Alcohol
121             6.00    11.56
18              8.70    14.19
98              4.50    12.37
52              7.05    13.82
13              5.40    14.75

3. alcohol이 14도 이상인 것은 높은 도수로 분류한다. 높은 도수의 와인들의 color intensity의 평균값을 정수형태로 구하고,  
 낮은 도수들의 color intensity 평균값의 차를 소수 둘째자리 까지 구하라

In [213]:
# 도수 높은것의 color intensity 평균을 정수로 구하기
alcohol_high = int ( wine.loc[wine['Alcohol']>= 14,['Color intensity']].mean().iloc[0] )

# 낮은 도수의 color intensity 평균 구하기
alcohol_low = wine.loc[wine['Alcohol'] < 14,['Color intensity']].mean()

# 평균값 차이를 소수 둘째까지 구하기
(alcohol_high - alcohol_low).round(2)

Color intensity    1.15
dtype: float64

4. class가 3인 와인들과 1인 와인들의 flavanoids 차이를 정수 형태로 구하라

In [218]:
# class를 그룹화로 flavanoids 평균을 구함
wine_class = wine.groupby(by='class', as_index = False)['Flavanoids'].mean()

# 그룹화 확인
wine_class

   class  Flavanoids
0      1    2.982373
1      2    2.080845
2      3    0.781458

In [220]:
# 클래스 3과 1의 차이를 정수로 표현하기
int( wine_class['Flavanoids'][2] - wine_class['Flavanoids'][0] )

-2

5. class 가 3인 그룹에서 Flavanoids 와 상관계수가 가장 높은 2개의 컬럼과 그 상관계수를 출력하라

In [235]:
# 클래스가 3인 데이터를 일단 뽑아내기.
class_3 = wine[wine['class']== 3]

# Flavanoids 와의 상관계수를 정렬하고, 상위 2개를 뽑아내기
class_3.corr()['Flavanoids'].abs().sort_values(ascending=False)[1:3]

Nonflavanoid phenols    0.634479
Magnesium               0.568779
Name: Flavanoids, dtype: float64

# 예제4

1. defense  방어력이 상위 10개인 포켓몬의 이름, 공격력으로 정렬된 데이터 프레임을 출력하라

In [242]:
# 라이브러리 불러오기
import pandas as pd

# 데이터 불러오기
pokemon = pd.read_csv(r'part2/1유형/Pokemon.csv')

# 데이터 확인
pokemon.head()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

In [244]:
# 방어력 기준으로 정렬하고, 거기서 상위 10개의 이름과 공격력의 데이터 프레임 추출
pokemon.sort_values(by='Defense',ascending = False)[['Name','Attack']][:10]

                    Name  Attack
230              Shuckle      10
224  SteelixMega Steelix     125
333    AggronMega Aggron     140
223              Steelix      85
414             Regirock     100
789              Avalugg     117
98              Cloyster      95
87   SlowbroMega Slowbro      75
332               Aggron     110
456            Bastiodon      52

2. type1이 grass인 포켓몬들의 hp 평균을 구하고, type1이 rock인 포켓몬 hp평균과의 차를 정수형태로 구하라

In [249]:
# type1과 hp를 기준으로 그룹화 해주기.
type1 = pokemon.groupby(by='Type 1',as_index= False)['HP'].mean()

# 확인
type1

      Type 1         HP
0        Bug  56.884058
1       Dark  66.806452
2     Dragon  83.312500
3   Electric  59.795455
4      Fairy  74.117647
5   Fighting  69.851852
6       Fire  69.903846
7     Flying  70.750000
8      Ghost  64.437500
9      Grass  67.271429
10    Ground  73.781250
11       Ice  72.000000
12    Normal  77.275510
13    Poison  67.250000
14   Psychic  70.631579
15      Rock  65.363636
16     Steel  65.222222
17     Water  72.062500

In [273]:
# 풀과 바위 속성의 hp차이를 정수로 표현
different =int( type1[type1['Type 1']== 'Grass']['HP'].iloc[0] - type1[type1['Type 1']== 'Rock']['HP'].iloc[0] )

# 차이를 구하기
different

1

3. legendary = True 인 경우의 total 값이 평균이상인 데이터를 추출하라.  
   추출된 데이터를 total 값이 작은 순서대로 정렬하고, 1부터 100까지 포켓몬의 speed의 평균을 소수 둘째까지 구하라

In [277]:
# 결측치가 있는지 확인
pokemon.isna().sum()

#               0
Name            0
Type 1          0
Type 2        386
Total           0
HP              0
Attack          0
Defense         0
Sp. Atk         0
Sp. Def         0
Speed           0
Generation      0
Legendary       0
dtype: int64

In [299]:
# legendary = True, total이 평균이상인 조건의 값을 뽑아내기
legend = pokemon[pokemon['Legendary']== True]
legend = legend[legend['Total'] >= legend['Total'].mean()]

# total이 작은 순서대로 상위 100개의 speed 평균을 구하라.
temp = legend.sort_values(by='Total')[:100]
result = temp['Speed'].mean().round(2)
result

101.18

4. generation 과 상관이 가장 큰 변수를 구하려고 한다.  
hp,attack, defense,speed 중에서 상관계수의 절댓값이 가장 큰 두 변수와 그 값을 구하라.

In [327]:
# generation의 상관계수 구하기
g_corr = pokemon.corr(numeric_only= True)['Generation'].abs()

# 지명된 변수를 뽑아내고, 그 값을 정렬해서 상위 2개 뽑아내기
g_corr[['HP','Attack','Defense','Speed']].sort_values(ascending=False)[:2]

HP        0.058683
Attack    0.051451
Name: Generation, dtype: float64

5. type1 이 fire인 경우 attack 하위 25% 값들의 평균을 구하시오.

In [364]:
# type1에서 fire에 해당하는 attack값들을 추출하기
fire_attack = pokemon.loc[pokemon['Type 1'] == 'Fire',['Attack']]

# 하위 25프로 해당하는 값 계산
attack_25 = fire_attack['Attack'].describe()['25%']

# 25% 값들의 평균을 구하기
fire_attack[fire_attack['Attack'] <= attack_25].mean()

Attack    50.0
dtype: float64

6. total이 600이고 속성이 rock인 포켓몬의 수를 구하라

In [381]:
len ( pokemon.loc[(pokemon['Total']== 600) & (pokemon['Type 1'] == 'Rock')] )

2

In [396]:
pokemon.loc[(pokemon['Total']== 600) & (pokemon['Type 1'] == 'Rock')].count()

#             2
Name          2
Type 1        2
Type 2        2
Total         2
HP            2
Attack        2
Defense       2
Sp. Atk       2
Sp. Def       2
Speed         2
Generation    2
Legendary     2
dtype: int64